app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 26 Mar 2014 06:18:35 UTC +00:00], ["updated_at", Wed, 26 Mar 2014 06:18:35 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 5], ["created_at", Tue, 01 Apr 2014 05:54:32 UTC +00:00], ["order_id", nil], ["product_id", 1], ["quantity", 1], ["updated_at", Tue, 01 Apr 2014 05:54:32 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2014-03-27 07:04:41.740981' WHERE "line_items"."id" = 16
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    @line_item.product = product

    respond_to do |format|
      if @line_item.save