app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "description" = 'coffee script is much interesting that we can code with enjoyable environment. we recommended that you should use this flavor and enjoy the best level of programing. Ruby on Rails is very exiting development environment. in which you can build several kind of commercial applications.', "updated_at" = '2014-03-20 06:37:00.104034' WHERE "products"."id" = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]
---
  def who_bought
    @product= Product.find(params[:id])