app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY title
---
  		def index
  			#if params[:set_locale]
  				#redirect_to store_path(locale: params[:set_locale])
  			#else

  				@products=Product.order(:title)