app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 03 Apr 2014 04:30:04 UTC +00:00], ["name", "akmal"], ["password_digest", "akmal"], ["updated_at", Thu, 03 Apr 2014 04:30:04 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save